#Область ОбработчикиКоманд

&НаКлиенте
Процедура СформироватьСводку(Команда)
	
	СформироватьСводкуНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьСводкуНаСервере()
	
	Результат = Объект.ВыполнитьОбработку(
		Новый Структура("ДатаНачала, ДатаОкончания", ДатаНачала, ДатаОкончания),
		Новый Структура);
	
	Сводка.Очистить();
	Для Каждого СтрокаСводки Из Результат Цикл
		НоваяСтрока = Сводка.Добавить();
		НоваяСтрока.Сущность = СтрокаСводки.Сущность;
		НоваяСтрока.Статус = СтрокаСводки.Статус;
		НоваяСтрока.Количество = СтрокаСводки.Количество;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
