# language: ru

Функционал: Дымовые тесты конфигурации КурсоваяРабота
    Проверка открытия разделов и списков прикладных объектов в стандартном интерфейсе.

Сценарий: Открытие разделов командного интерфейса
    Когда Я нажимаю кнопку командного интерфейса "Оператор сопровождения"
    Когда Я нажимаю кнопку командного интерфейса "Координатор логистики"
    Когда Я нажимаю кнопку командного интерфейса "Гид на маршруте"
    Когда Я нажимаю кнопку командного интерфейса "Менеджер по претензиям"
    Когда Я нажимаю кнопку командного интерфейса "Руководитель направления"
    Когда Я нажимаю кнопку командного интерфейса "Администратор ИС"
    Когда Я нажимаю кнопку командного интерфейса "Сервис"

Сценарий: Открытие списка - Справочник Валюты
    Дано Я открываю навигационную ссылку "e1cib/list/Справочник.Валюты"
    Тогда открылось окно "Валюты*"

Сценарий: Открытие списка - Справочник Договоры споставщиками
    Дано Я открываю навигационную ссылку "e1cib/list/Справочник.ДоговорыСПоставщиками"
    Тогда открылось окно "Договоры споставщиками*"

Сценарий: Открытие списка - Справочник Единицы измерения
    Дано Я открываю навигационную ссылку "e1cib/list/Справочник.ЕдиницыИзмерения"
    Тогда открылось окно "Единицы измерения*"

Сценарий: Открытие списка - Справочник Заявки на тур
    Дано Я открываю навигационную ссылку "e1cib/list/Справочник.ЗаявкиНаТур"
    Тогда открылось окно "Заявки на тур*"

Сценарий: Открытие списка - Справочник Номенклатура услуг
    Дано Я открываю навигационную ссылку "e1cib/list/Справочник.НоменклатураУслуг"
    Тогда открылось окно "Номенклатура услуг*"

Сценарий: Открытие списка - Справочник Объекты гостеприимства
    Дано Я открываю навигационную ссылку "e1cib/list/Справочник.ОбъектыГостеприимства"
    Тогда открылось окно "Объекты гостеприимства*"

Сценарий: Открытие списка - Справочник Пользователи
    Дано Я открываю навигационную ссылку "e1cib/list/Справочник.Пользователи"
    Тогда открылось окно "Пользователи*"

Сценарий: Открытие списка - Справочник Поставщики
    Дано Я открываю навигационную ссылку "e1cib/list/Справочник.Поставщики"
    Тогда открылось окно "Поставщики*"

Сценарий: Открытие списка - Справочник Сотрудники
    Дано Я открываю навигационную ссылку "e1cib/list/Справочник.Сотрудники"
    Тогда открылось окно "Сотрудники*"

Сценарий: Открытие списка - Справочник Страны мира
    Дано Я открываю навигационную ссылку "e1cib/list/Справочник.СтраныМира"
    Тогда открылось окно "Страны мира*"

Сценарий: Открытие списка - Справочник Типы запросов туристов
    Дано Я открываю навигационную ссылку "e1cib/list/Справочник.ТипыЗапросовТуристов"
    Тогда открылось окно "Типы запросов туристов*"

Сценарий: Открытие списка - Справочник Типы инцидентов
    Дано Я открываю навигационную ссылку "e1cib/list/Справочник.ТипыИнцидентов"
    Тогда открылось окно "Типы инцидентов*"

Сценарий: Открытие списка - Справочник Туристы
    Дано Я открываю навигационную ссылку "e1cib/list/Справочник.Туристы"
    Тогда открылось окно "Туристы*"

Сценарий: Открытие списка - Справочник Туры маршруты
    Дано Я открываю навигационную ссылку "e1cib/list/Справочник.ТурыМаршруты"
    Тогда открылось окно "Туры маршруты*"

Сценарий: Открытие списка - Документ Акт окомпенсации
    Дано Я открываю навигационную ссылку "e1cib/list/Документ.АктОКомпенсации"
    Тогда открылось окно "Акт окомпенсации*"

Сценарий: Открытие списка - Документ Заказ поставщику
    Дано Я открываю навигационную ссылку "e1cib/list/Документ.ЗаказПоставщику"
    Тогда открылось окно "Заказ поставщику*"

Сценарий: Открытие списка - Документ Заявка туриста на маршруте
    Дано Я открываю навигационную ссылку "e1cib/list/Документ.ЗаявкаТуристаНаМаршруте"
    Тогда открылось окно "Заявка туриста на маршруте*"

Сценарий: Открытие списка - Документ Инцидент
    Дано Я открываю навигационную ссылку "e1cib/list/Документ.Инцидент"
    Тогда открылось окно "Инцидент*"

Сценарий: Открытие списка - Документ Корректировка маршрута
    Дано Я открываю навигационную ссылку "e1cib/list/Документ.КорректировкаМаршрута"
    Тогда открылось окно "Корректировка маршрута*"

Сценарий: Открытие списка - Документ Маршрутный лист
    Дано Я открываю навигационную ссылку "e1cib/list/Документ.МаршрутныйЛист"
    Тогда открылось окно "Маршрутный лист*"

Сценарий: Открытие списка - Документ Подтверждение услуги
    Дано Я открываю навигационную ссылку "e1cib/list/Документ.ПодтверждениеУслуги"
    Тогда открылось окно "Подтверждение услуги*"

Сценарий: Открытие списка - Документ Претензия поставщику
    Дано Я открываю навигационную ссылку "e1cib/list/Документ.ПретензияПоставщику"
    Тогда открылось окно "Претензия поставщику*"

Сценарий: Открытие списка - Документ Событие маршрута
    Дано Я открываю навигационную ссылку "e1cib/list/Документ.СобытиеМаршрута"
    Тогда открылось окно "Событие маршрута*"

Сценарий: Открытие списка - РегистрСведений Адресация задач
    Дано Я открываю навигационную ссылку "e1cib/list/РегистрСведений.АдресацияЗадач"
    Тогда открылось окно "Адресация задач*"

Сценарий: Открытие списка - РегистрСведений График перемещений
    Дано Я открываю навигационную ссылку "e1cib/list/РегистрСведений.ГрафикПеремещений"
    Тогда открылось окно "График перемещений*"

Сценарий: Открытие списка - РегистрСведений История обработок запросов
    Дано Я открываю навигационную ссылку "e1cib/list/РегистрСведений.ИсторияОбработокЗапросов"
    Тогда открылось окно "История обработок запросов*"

Сценарий: Открытие списка - РегистрСведений Настройки интеграций
    Дано Я открываю навигационную ссылку "e1cib/list/РегистрСведений.НастройкиИнтеграций"
    Тогда открылось окно "Настройки интеграций*"

Сценарий: Открытие списка - РегистрСведений Параметры услуг
    Дано Я открываю навигационную ссылку "e1cib/list/РегистрСведений.ПараметрыУслуг"
    Тогда открылось окно "Параметры услуг*"

Сценарий: Открытие списка - РегистрСведений Сроки контроля
    Дано Я открываю навигационную ссылку "e1cib/list/РегистрСведений.СрокиКонтроля"
    Тогда открылось окно "Сроки контроля*"

Сценарий: Открытие списка - РегистрСведений Статусы инцидентов
    Дано Я открываю навигационную ссылку "e1cib/list/РегистрСведений.СтатусыИнцидентов"
    Тогда открылось окно "Статусы инцидентов*"

Сценарий: Открытие списка - РегистрСведений Статусы подтверждений
    Дано Я открываю навигационную ссылку "e1cib/list/РегистрСведений.СтатусыПодтверждений"
    Тогда открылось окно "Статусы подтверждений*"

Сценарий: Открытие списка - РегистрНакопления Kpiоператоров
    Дано Я открываю навигационную ссылку "e1cib/list/РегистрНакопления.KPIОператоров"
    Тогда открылось окно "Kpiоператоров*"

Сценарий: Открытие списка - РегистрНакопления Взаиморасчёты по претензиям
    Дано Я открываю навигационную ссылку "e1cib/list/РегистрНакопления.ВзаиморасчётыПоПретензиям"
    Тогда открылось окно "Взаиморасчёты по претензиям*"

Сценарий: Открытие списка - РегистрНакопления Штрафы икомпенсации
    Дано Я открываю навигационную ссылку "e1cib/list/РегистрНакопления.ШтрафыИКомпенсации"
    Тогда открылось окно "Штрафы икомпенсации*"

Сценарий: Открытие списка - БизнесПроцесс Контроль подтверждений
    Дано Я открываю навигационную ссылку "e1cib/list/БизнесПроцесс.КонтрольПодтверждений"
    Тогда открылось окно "Контроль подтверждений*"

Сценарий: Открытие списка - БизнесПроцесс Координация маршрута
    Дано Я открываю навигационную ссылку "e1cib/list/БизнесПроцесс.КоординацияМаршрута"
    Тогда открылось окно "Координация маршрута*"

Сценарий: Открытие списка - БизнесПроцесс Обработка запроса туриста
    Дано Я открываю навигационную ссылку "e1cib/list/БизнесПроцесс.ОбработкаЗапросаТуриста"
    Тогда открылось окно "Обработка запроса туриста*"

Сценарий: Открытие списка - БизнесПроцесс Урегулирование инцидента
    Дано Я открываю навигационную ссылку "e1cib/list/БизнесПроцесс.УрегулированиеИнцидента"
    Тогда открылось окно "Урегулирование инцидента*"

Сценарий: Открытие списка - Задача Задача исполнителя
    Дано Я открываю навигационную ссылку "e1cib/list/Задача.ЗадачаИсполнителя"
    Тогда открылось окно "Задача исполнителя*"

Сценарий: Открытие списка - ПланВидовХарактеристик Дополнительные реквизиты туриста
    Дано Я открываю навигационную ссылку "e1cib/list/ПланВидовХарактеристик.ДополнительныеРеквизитыТуриста"
    Тогда открылось окно "Дополнительные реквизиты туриста*"

Сценарий: Открытие списка - ПланВидовХарактеристик Дополнительные реквизиты услуг
    Дано Я открываю навигационную ссылку "e1cib/list/ПланВидовХарактеристик.ДополнительныеРеквизитыУслуг"
    Тогда открылось окно "Дополнительные реквизиты услуг*"
